Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.rerank.endpoint.hint
source: Complete POST URL. TEI uses /rerank; Cohere-compatible services commonly use /v2/rerank.
ar: عنوان URL الكامل لطلب POST. تستخدم TEI /rerank؛ والخدمات المتوافقة مع Cohere تستخدم عادةً /v2/rerank.
de: Vollständige POST-URL. TEI verwendet /rerank; Cohere-kompatible Dienste verwenden üblicherweise /v2/rerank.
es: URL POST completa. TEI usa /rerank; los servicios compatibles con Cohere suelen usar /v2/rerank.
fr: URL POST complète. TEI utilise /rerank ; les services compatibles Cohere utilisent généralement /v2/rerank.
id: URL POST lengkap. TEI menggunakan /rerank; layanan yang kompatibel dengan Cohere biasanya menggunakan /v2/rerank.
it: URL POST completo. TEI usa /rerank; i servizi compatibili con Cohere usano comunemente /v2/rerank.
ja: 完全なPOST URL。TEIは/rerank、Cohere互換サービスは通常/v2/rerankを使用します。
ko: 전체 POST URL입니다. TEI는 /rerank를 사용하고, Cohere 호환 서비스는 일반적으로 /v2/rerank를 사용합니다.
nl: Volledige POST-URL. TEI gebruikt /rerank; Cohere-compatibele services gebruiken vaak /v2/rerank.
pl: Pełny adres URL POST. TEI używa /rerank; usługi zgodne z Cohere zwykle używają /v2/rerank.
pt_br: URL POST completa. TEI usa /rerank; serviços compatíveis com Cohere geralmente usam /v2/rerank.
ru: Полный URL для POST. TEI использует /rerank; совместимые с Cohere сервисы обычно используют /v2/rerank.
tr: Tam POST URL'si. TEI /rerank kullanır; Cohere uyumlu hizmetler genellikle /v2/rerank kullanır.
uk: Повна POST-URL-адреса. TEI використовує /rerank; сумісні з Cohere служби зазвичай використовують /v2/rerank.
vi: URL POST đầy đủ. TEI sử dụng /rerank; các dịch vụ tương thích Cohere thường dùng /v2/rerank.
zh_hans: 完整 POST 地址：TEI 使用 /rerank；Cohere-compatible 服务通常使用 /v2/rerank。
zh_hant: 完整 POST 位址：TEI 使用 /rerank；Cohere-compatible 服務通常使用 /v2/rerank。

# rag.workspace.rerank.model
source: Model
ar: النموذج
de: Modell
es: Modelo
fr: Modèle
it: Modello
ja: モデル
ko: 모델
pt_br: Modelo
ru: Модель
uk: Модель
vi: Mô hình
zh_hans: 模型
zh_hant: 模型

# rag.workspace.rerank.model.hint
source: Required by Cohere-compatible services. TEI selects its model when the server starts.
ar: مطلوب للخدمات المتوافقة مع Cohere. تختار TEI نموذجها عند بدء الخادم.
de: Erforderlich für Cohere-kompatible Dienste. TEI wählt sein Modell beim Serverstart aus.
es: Requerido por servicios compatibles con Cohere. TEI selecciona su modelo al iniciar el servidor.
fr: Requis par les services compatibles Cohere. TEI sélectionne son modèle au démarrage du serveur.
id: Diperlukan oleh layanan yang kompatibel dengan Cohere. TEI memilih modelnya saat server dimulai.
it: Richiesto dai servizi compatibili con Cohere. TEI seleziona il proprio modello all'avvio del server.
ja: Cohere互換サービスで必須。TEIはサーバー起動時にモデルを選択します。
ko: Cohere 호환 서비스에 필요합니다. TEI는 서버 시작 시 모델을 선택합니다.
nl: Vereist door Cohere-compatibele services. TEI selecteert zijn model wanneer de server start.
pl: Wymagane przez usługi zgodne z Cohere. TEI wybiera swój model podczas uruchamiania serwera.
pt_br: Obrigatório para serviços compatíveis com Cohere. O TEI seleciona seu modelo quando o servidor inicia.
ru: Требуется для сервисов, совместимых с Cohere. TEI выбирает модель при запуске сервера.
tr: Cohere uyumlu hizmetler için gereklidir. TEI, sunucu başladığında modelini seçer.
uk: Обов'язково для служб, сумісних з Cohere. TEI вибирає свою модель під час запуску сервера.
vi: Bắt buộc đối với các dịch vụ tương thích Cohere. TEI chọn mô hình của nó khi máy chủ khởi động.
zh_hans: Cohere-compatible 服务必填；TEI 在服务启动时确定模型。
zh_hant: Cohere-compatible 服務必填；TEI 在服務啟動時決定模型。

# rag.workspace.rerank.provider
source: Service Type
ar: نوع الخدمة
de: Diensttyp
es: Tipo de servicio
fr: Type de service
id: Tipe Layanan
it: Tipo di servizio
ja: サービス種別
ko: 서비스 유형
pl: Typ usługi
pt_br: Tipo de serviço
ru: Тип службы
tr: Hizmet Türü
uk: Тип служби
vi: Loại dịch vụ
zh_hans: 服务类型
zh_hant: 服務類型

# rag.workspace.rerank.provider.cohere
source: Cohere-compatible
ar: متوافق مع Cohere
de: Cohere-kompatibel
es: Compatible con Cohere
fr: Compatible Cohere
id: Kompatibel dengan Cohere
it: Compatibile con Cohere
ja: Cohere互換
ko: Cohere 호환
nl: Cohere-compatibel
pl: Zgodne z Cohere
pt_br: Compatível com Cohere
ru: Совместимый с Cohere
tr: Cohere uyumlu
uk: Сумісний з Cohere
vi: Tương thích Cohere

# rag.workspace.rerank.title
source: Rerank
ar: إعادة الترتيب
fr: Reclassement
ko: 재순위화
nl: Herordenen
pl: Ponowny ranking
ru: Переранжирование
tr: Yeniden Sırala
uk: Переранжування

# rag.workspace.retrieval.advanced.title
source: Advanced
ar: متقدم
de: Erweitert
es: Avanzado
fr: Avancé
id: Lanjutan
it: Avanzate
ja: 詳細
ko: 고급
nl: Geavanceerd
pl: Zaawansowane
pt_br: Avançado
ru: Дополнительно
tr: Gelişmiş
uk: Розширені
vi: Nâng cao
zh_hans: 高级
zh_hant: 進階

# rag.workspace.retrieval.common.title
source: Common
ar: شائع
de: Allgemein
es: Común
fr: Commun
id: Umum
it: Comuni
ja: 共通
ko: 일반
nl: Algemeen
pl: Ogólne
pt_br: Comum
ru: Общие
tr: Genel
uk: Загальні
vi: Phổ biến
zh_hans: 常用
zh_hant: 常用

# rag.workspace.retrieval.finalChunkLimit
source: Final Chunk Limit
ar: حد الأجزاء النهائي
de: Endgültiges Chunk-Limit
es: Límite de fragmentos finales
fr: Limite finale de fragments
id: Batas Potongan Akhir
it: Limite blocchi finali
ja: 最終チャンク制限
ko: 최종 청크 제한
nl: Uiteindelijke broklimiet
pl: Limit końcowych fragmentów
pt_br: Limite final de fragmentos
ru: Лимит итоговых фрагментов
tr: Nihai Parça Limiti
uk: Ліміт остаточних фрагментів
vi: Giới hạn khối cuối cùng
zh_hans: 最终分片上限
zh_hant: 最終分片上限

# rag.workspace.retrieval.finalChunkLimit.hint
source: Maximum number of chunks used as LLM context for this answer. The per-repository chunk limit is applied first, then the top N chunks in final order are selected. If other repositories do not have enough chunks, the actual count can be lower than this limit.
ar: الحد الأقصى لعدد الأجزاء المُستخدمة كسياق LLM لهذه الإجابة. يُطبق حد الأجزاء لكل مستودع أولاً، ثم تُختار أفضل N جزء بالترتيب النهائي. إذا لم يكن لدى المستودعات الأخرى أجزاء كافية، فقد يكون العدد الفعلي أقل من هذا الحد.
de: Maximale Anzahl von Chunks, die als LLM-Kontext für diese Antwort verwendet werden. Das Pro-Repository-Chunk-Limit wird zuerst angewendet, dann werden die obersten N Chunks in der endgültigen Reihenfolge ausgewählt. Wenn andere Repositorys nicht genügend Chunks haben, kann die tatsächliche Anzahl niedriger sein als dieses Limit.
es: Número máximo de fragmentos utilizados como contexto del LLM para esta respuesta. Primero se aplica el límite por repositorio, luego se seleccionan los N fragmentos principales en orden final. Si otros repositorios no tienen suficientes fragmentos, el recuento real puede ser inferior a este límite.
fr: Nombre maximum de fragments utilisés comme contexte LLM pour cette réponse. La limite par dépôt est d'abord appliquée, puis les N meilleurs fragments dans l'ordre final sont sélectionnés. Si les autres dépôts n'ont pas assez de fragments, le nombre réel peut être inférieur à cette limite.
id: Jumlah maksimum potongan yang digunakan sebagai konteks LLM untuk jawaban ini. Batas potongan per repositori diterapkan terlebih dahulu, kemudian N potongan teratas dalam urutan akhir dipilih. Jika repositori lain tidak memiliki cukup potongan, jumlah aktual bisa lebih rendah dari batas ini.
it: Numero massimo di blocchi usati come contesto LLM per questa risposta. Il limite per repository viene applicato per primo, poi vengono selezionati i primi N blocchi in ordine finale. Se altri repository non hanno abbastanza blocchi, il conteggio effettivo può essere inferiore a questo limite.
ja: この回答でLLMコンテキストとして使用するチャンクの最大数。リポジトリごとのチャンク制限が最初に適用され、その後最終順序で上位Nチャンクが選択されます。他のリポジトリに十分なチャンクがない場合、実際の数はこの制限より少なくなることがあります。
ko: 이 답변의 LLM 컨텍스트로 사용되는 최대 청크 수입니다. 저장소별 청크 제한이 먼저 적용된 후 최종 순서에서 상위 N개 청크가 선택됩니다. 다른 저장소에 충분한 청크가 없으면 실제 개수가 이 제한보다 낮을 수 있습니다.
nl: Maximum aantal brokken dat als LLM-context voor dit antwoord wordt gebruikt. De broklimiet per repository wordt eerst toegepast, waarna de top N brokken in uiteindelijke volgorde worden geselecteerd. Als andere repositories niet genoeg brokken hebben, kan het werkelijke aantal lager zijn dan deze limiet.
pl: Maksymalna liczba fragmentów użytych jako kontekst LLM dla tej odpowiedzi. Najpierw stosowany jest limit fragmentów na repozytorium, a następnie wybieranych jest N najlepszych fragmentów w końcowej kolejności. Jeśli inne repozytoria nie mają wystarczającej liczby fragmentów, rzeczywista liczba może być niższa niż ten limit.
pt_br: Número máximo de fragmentos usados como contexto do LLM para esta resposta. O limite de fragmentos por repositório é aplicado primeiro, depois os N principais fragmentos na ordem final são selecionados. Se outros repositórios não tiverem fragmentos suficientes, a contagem real pode ser menor que este limite.
ru: Максимальное количество фрагментов, используемых как контекст LLM для этого ответа. Сначала применяется лимит на репозиторий, затем выбираются N лучших фрагментов в итоговом порядке. Если в других репозиториях недостаточно фрагментов, фактическое количество может быть меньше этого лимита.
tr: Bu yanıt için LLM bağlamı olarak kullanılan maksimum parça sayısı. Depo başına parça limiti önce uygulanır, ardından nihai sıradaki ilk N parça seçilir. Diğer depolarda yeterli parça yoksa gerçek sayı bu limitten düşük olabilir.
uk: Максимальна кількість фрагментів, що використовуються як контекст LLM для цієї відповіді. Спочатку застосовується ліміт фрагментів на репозиторій, потім вибираються найкращі N фрагментів у остаточному порядку. Якщо інші репозиторії не мають достатньо фрагментів, фактична кількість може бути меншою за цей ліміт.
vi: Số lượng khối tối đa được sử dụng làm ngữ cảnh LLM cho câu trả lời này. Giới hạn khối mỗi kho lưu trữ được áp dụng trước, sau đó N khối hàng đầu theo thứ tự cuối cùng được chọn. Nếu các kho lưu trữ khác không có đủ khối, số lượng thực tế có thể thấp hơn giới hạn này.
zh_hans: 本轮最多使用多少条分片作为 LLM 上下文。先应用“单仓库分片上限”，再按最终排序取前 N 条；其他仓库分片不足时，实际数量可能少于此上限。
zh_hant: 本輪最多使用多少條分片作為 LLM 上下文。先套用「單倉庫分片上限」，再按最終排序取前 N 條；其他倉庫分片不足時，實際數量可能少於此上限。

# rag.workspace.retrieval.minimumSimilarity
source: Minimum Vector Similarity
ar: الحد الأدنى لتشابه المتجهات
de: Minimale Vektorähnlichkeit
es: Similitud vectorial mínima
fr: Similarité vectorielle minimale
id: Kemiripan Vektor Minimum
it: Similarità vettoriale minima
ja: 最小ベクトル類似度
ko: 최소 벡터 유사도
nl: Minimale vectorovereenkomst
pl: Minimalne podobieństwo wektorowe
pt_br: Similaridade vetorial mínima
ru: Минимальное векторное сходство
tr: Minimum Vektör Benzerliği
uk: Мінімальна векторна схожість
vi: Độ tương đồng vector tối thiểu
zh_hans: 最低向量相似度
zh_hant: 最低向量相似度

# rag.workspace.retrieval.minimumSimilarity.hint
source: Vector results below this score are excluded. Exact keyword matches remain available.
ar: تُستبعد نتائج المتجهات التي تقل عن هذه النتيجة. تظل مطابقات الكلمات المفتاحية الدقيقة متاحة.
de: Vektorergebnisse unterhalb dieses Werts werden ausgeschlossen. Exakte Schlüsselwortübereinstimmungen bleiben verfügbar.
es: Los resultados vectoriales por debajo de esta puntuación se excluyen. Las coincidencias exactas de palabras clave permanecen disponibles.
fr: Les résultats vectoriels en dessous de ce score sont exclus. Les correspondances exactes par mot-clé restent disponibles.
id: Hasil vektor di bawah skor ini dikecualikan. Pencocokan kata kunci tepat tetap tersedia.
it: I risultati vettoriali al di sotto di questo punteggio vengono esclusi. Le corrispondenze esatte per parole chiave rimangono disponibili.
ja: このスコア未満のベクトル結果は除外されます。完全一致キーワードは引き続き利用可能です。
ko: 이 점수 미만의 벡터 결과는 제외됩니다. 정확한 키워드 일치는 계속 사용 가능합니다.
nl: Vectorresultaten onder deze score worden uitgesloten. Exacte trefwoordovereenkomsten blijven beschikbaar.
pl: Wyniki wektorowe poniżej tego progu są wykluczane. Dokładne dopasowania słów kluczowych pozostają dostępne.
pt_br: Resultados vetoriais abaixo desta pontuação são excluídos. Correspondências exatas por palavra-chave permanecem disponíveis.
ru: Векторные результаты ниже этого порога исключаются. Точные совпадения по ключевым словам остаются доступными.
tr: Bu puanın altındaki vektör sonuçları hariç tutulur. Tam anahtar kelime eşleşmeleri kullanılabilir durumda kalır.
uk: Векторні результати з оцінкою нижче цього значення виключаються. Точні збіги ключових слів залишаються доступними.
vi: Kết quả vector dưới điểm này bị loại trừ. Các kết quả khớp từ khóa chính xác vẫn có sẵn.
zh_hans: 低于此分数的向量结果不会参与检索；关键词精确匹配不受影响。
zh_hant: 低於此分數的向量結果不會參與檢索；關鍵字精確比對不受影響。

# rag.workspace.retrieval.perRepositoryLimit
source: Per-Repository Chunk Limit
ar: حد الأجزاء لكل مستودع
de: Chunk-Limit pro Repository
es: Límite de fragmentos por repositorio
fr: Limite de fragments par dépôt
id: Batas Potongan per Repositori
it: Limite blocchi per repository
ja: リポジトリごとのチャンク制限
ko: 저장소별 청크 제한
nl: Broklimiet per repository
pl: Limit fragmentów na repozytorium
pt_br: Limite de fragmentos por repositório
ru: Лимит фрагментов на репозиторий
tr: Depo Başına Parça Limiti
uk: Ліміт фрагментів на репозиторій
vi: Giới hạn khối mỗi kho lưu trữ
zh_hans: 单仓库分片上限
zh_hant: 單倉庫分片上限

# rag.workspace.retrieval.perRepositoryLimit.hint
source: Maximum number of chunks retained from the same repository. The system selects chunks in final order; after a repository reaches this limit, its later chunks are skipped and chunks from other repositories continue to fill the result.
ar: الحد الأقصى لعدد الأجزاء المُحتفظ بها من نفس المستودع. يختار النظام الأجزاء بالترتيب النهائي؛ بعد أن يصل المستودع إلى هذا الحد، يتم تخطي أجزائه اللاحقة وتستمر أجزاء المستودعات الأخرى في ملء النتيجة.
de: Maximale Anzahl von Chunks, die aus demselben Repository beibehalten werden. Das System wählt Chunks in der endgültigen Reihenfolge aus; nachdem ein Repository dieses Limit erreicht hat, werden seine späteren Chunks übersprungen und Chunks aus anderen Repositorys füllen das Ergebnis weiter auf.
es: Número máximo de fragmentos retenidos del mismo repositorio. El sistema selecciona fragmentos en orden final; después de que un repositorio alcanza este límite, sus fragmentos posteriores se omiten y los fragmentos de otros repositorios continúan llenando el resultado.
fr: Nombre maximum de fragments conservés du même dépôt. Le système sélectionne les fragments dans l'ordre final ; après qu'un dépôt atteint cette limite, ses fragments suivants sont ignorés et les fragments d'autres dépôts continuent à remplir le résultat.
id: Jumlah maksimum potongan yang dipertahankan dari repositori yang sama. Sistem memilih potongan dalam urutan akhir; setelah repositori mencapai batas ini, potongan selanjutnya dilewati dan potongan dari repositori lain terus mengisi hasil.
it: Numero massimo di blocchi conservati dallo stesso repository. Il sistema seleziona i blocchi in ordine finale; dopo che un repository raggiunge questo limite, i suoi blocchi successivi vengono saltati e i blocchi di altri repository continuano a riempire il risultato.
ja: 同じリポジトリから保持されるチャンクの最大数。システムは最終順序でチャンクを選択します。リポジトリがこの制限に達すると、それ以降のチャンクはスキップされ、他のリポジトリのチャンクが結果を埋め続けます。
ko: 동일한 저장소에서 유지되는 최대 청크 수입니다. 시스템은 최종 순서로 청크를 선택하며, 저장소가 이 제한에 도달하면 이후 청크는 건너뛰고 다른 저장소의 청크가 결과를 채웁니다.
nl: Maximum aantal brokken dat uit dezelfde repository wordt behouden. Het systeem selecteert brokken in uiteindelijke volgorde; nadat een repository deze limiet heeft bereikt, worden de latere brokken overgeslagen en vullen brokken uit andere repositories het resultaat aan.
pl: Maksymalna liczba fragmentów zachowanych z tego samego repozytorium. System wybiera fragmenty w końcowej kolejności; po osiągnięciu limitu przez repozytorium, jego późniejsze fragmenty są pomijane, a fragmenty z innych repozytoriów wypełniają wynik.
pt_br: Número máximo de fragmentos retidos do mesmo repositório. O sistema seleciona fragmentos na ordem final; após um repositório atingir este limite, seus fragmentos posteriores são ignorados e fragmentos de outros repositórios continuam a preencher o resultado.
ru: Максимальное количество фрагментов, сохраняемых из одного репозитория. Система выбирает фрагменты в итоговом порядке; после достижения лимита для репозитория его последующие фрагменты пропускаются, а фрагменты из других репозиториев продолжают заполнять результат.
tr: Aynı depodan korunan maksimum parça sayısı. Sistem parçaları nihai sıraya göre seçer; bir depo bu limite ulaştığında, sonraki parçaları atlanır ve diğer depolardan gelen parçalar sonucu doldurmaya devam eder.
uk: Максимальна кількість фрагментів, що зберігаються з одного репозиторію. Система вибирає фрагменти в остаточному порядку; після досягнення цього ліміту репозиторієм його наступні фрагменти пропускаються, а фрагменти з інших репозиторіїв продовжують заповнювати результат.
vi: Số lượng khối tối đa được giữ lại từ cùng một kho lưu trữ. Hệ thống chọn các khối theo thứ tự cuối cùng; sau khi một kho lưu trữ đạt đến giới hạn này, các khối sau của nó bị bỏ qua và các khối từ kho lưu trữ khác tiếp tục lấp đầy kết quả.
zh_hans: 同一仓库最多保留多少条分片。系统按重排后的顺序逐条选择；仓库达到上限后，会跳过该仓库后续分片，继续选择其他仓库的分片。
zh_hant: 同一倉庫最多保留多少條分片。系統按重排後的順序逐條選取；倉庫達到上限後，會跳過該倉庫後續分片，繼續選取其他倉庫的分片。

# rag.workspace.retrieval.preset.balanced
source: Balanced
ar: متوازن
de: Ausgewogen
es: Equilibrado
fr: Équilibré
id: Seimbang
it: Bilanciato
ja: バランス
ko: 균형
nl: Gebalanceerd
pl: Zrównoważone
pt_br: Balanceado
ru: Сбалансированный
tr: Dengeli
uk: Збалансований
vi: Cân bằng
zh_hans: 平衡
zh_hant: 平衡

# rag.workspace.retrieval.preset.broad
source: Broad
ar: واسع
de: Breit
es: Amplio
fr: Large
id: Luas
it: Ampio
ja: 広範囲
ko: 광범위
nl: Breed
pl: Szerokie
pt_br: Amplo
ru: Широкий
tr: Geniş
uk: Широкий
vi: Rộng
zh_hans: 广泛
zh_hant: 廣泛

# rag.workspace.retrieval.preset.custom
source: Custom
ar: مخصص
de: Benutzerdefiniert
es: Personalizado
fr: Personnalisé
id: Kustom
it: Personalizzato
ja: カスタム
ko: 사용자 정의
nl: Aangepast
pl: Niestandardowe
pt_br: Personalizado
ru: Пользовательский
tr: Özel
uk: Користувацький
vi: Tùy chỉnh
zh_hans: 自定义
zh_hant: 自訂

# rag.workspace.retrieval.preset.strict
source: Strict
ar: صارم
de: Streng
es: Estricto
id: Ketat
it: Rigoroso
ja: 厳格
ko: 엄격
nl: Strikt
pl: Ścisłe
pt_br: Estrito
ru: Строгий
tr: Katı
uk: Суворий
vi: Nghiêm ngặt
zh_hans: 严格
zh_hant: 嚴格

# rag.workspace.retrieval.preset.title
source: Preset
ar: الإعداد المسبق
de: Voreinstellung
es: Predefinido
fr: Préréglage
id: Prasetel
it: Preimpostazione
ja: プリセット
ko: 사전 설정
nl: Voorinstelling
pl: Ustawienie wstępne
pt_br: Predefinição
ru: Пресет
tr: Ön Ayar
uk: Попереднє налаштування
vi: Cài đặt sẵn
zh_hans: 预设
zh_hant: 預設

# rag.workspace.retrieval.restoreDefaults
source: Restore Defaults
ar: استعادة الافتراضيات
de: Standardwerte wiederherstellen
es: Restaurar valores predeterminados
fr: Restaurer les valeurs par défaut
id: Kembalikan Default
it: Ripristina impostazioni predefinite
ja: デフォルトに戻す
ko: 기본값 복원
nl: Standaardwaarden herstellen
pl: Przywróć domyślne
pt_br: Restaurar padrões
ru: Восстановить значения по умолчанию
tr: Varsayılanları Geri Yükle
uk: Відновити типові
vi: Khôi phục mặc định
zh_hans: 恢复默认
zh_hant: 恢復預設

# rag.workspace.retrieval.source.metadata
source: Repository Metadata
ar: بيانات المستودع الوصفية
de: Repository-Metadaten
es: Metadatos del repositorio
fr: Métadonnées du dépôt
id: Metadata Repositori
it: Metadati repository
ja: リポジトリメタデータ
ko: 저장소 메타데이터
pl: Metadane repozytorium
pt_br: Metadados do repositório
ru: Метаданные репозитория
tr: Depo Meta Verileri
uk: Метадані репозиторію
vi: Siêu dữ liệu kho lưu trữ
zh_hans: 仓库元数据
zh_hant: 倉庫元資料

# rag.workspace.retrieval.source.notes
source: Personal Notes
ar: ملاحظات شخصية
de: Persönliche Notizen
es: Notas personales
fr: Notes personnelles
id: Catatan Pribadi
it: Note personali
ja: 個人メモ
ko: 개인 노트
nl: Persoonlijke notities
pl: Notatki osobiste
pt_br: Notas pessoais
ru: Личные заметки
tr: Kişisel Notlar
uk: Особисті нотатки
vi: Ghi chú cá nhân
zh_hans: 个人笔记
zh_hant: 個人筆記

# rag.workspace.retrieval.source.summary
source: AI Summaries
ar: ملخصات AI
de: KI-Zusammenfassungen
es: Resúmenes de IA
fr: Résumés IA
id: Ringkasan AI
it: Riepiloghi AI
ja: AIサマリー
ko: AI 요약
nl: AI-samenvattingen
pl: Podsumowania AI
pt_br: Resumos de IA
ru: AI-сводки
tr: Yapay Zeka Özetleri
uk: Підсумки ШІ
vi: Tóm tắt AI
zh_hans: AI 摘要
zh_hant: AI 摘要

# rag.workspace.retrieval.sources.hint
source: Choose which knowledge sources can participate in local retrieval.
ar: اختر مصادر المعرفة التي يمكنها المشاركة في الاسترجاع المحلي.
de: Wählen Sie aus, welche Wissensquellen am lokalen Abruf teilnehmen können.
es: Elija qué fuentes de conocimiento pueden participar en la recuperación local.
fr: Choisissez les sources de connaissances pouvant participer à la récupération locale.
id: Pilih sumber pengetahuan mana yang dapat berpartisipasi dalam retrieval lokal.
it: Scegli quali fonti di conoscenza possono partecipare al recupero locale.
ja: ローカル検索に参加できるナレッジソースを選択します。
ko: 로컬 검색에 참여할 지식 소스를 선택하세요.
nl: Kies welke kennisbronnen kunnen deelnemen aan lokaal ophalen.
pl: Wybierz, które źródła wiedzy mogą uczestniczyć w lokalnym wyszukiwaniu.
pt_br: Escolha quais fontes de conhecimento podem participar da recuperação local.
ru: Выберите, какие источники знаний могут участвовать в локальном поиске.
tr: Yerel getiriye hangi bilgi kaynaklarının katılabileceğini seçin.
uk: Виберіть, які джерела знань можуть брати участь у локальному пошуку.
vi: Chọn nguồn kiến thức có thể tham gia truy xuất cục bộ.
zh_hans: 选择可参与本地检索的数据来源。
zh_hant: 選擇可參與本地檢索的知識來源。

# rag.workspace.retrieval.sources.title
source: Data Sources
ar: مصادر البيانات
de: Datenquellen
es: Fuentes de datos
fr: Sources de données
id: Sumber Data
it: Fonti dati
ja: データソース
ko: 데이터 소스
nl: Gegevensbronnen
pl: Źródła danych
pt_br: Fontes de dados
ru: Источники данных
tr: Veri Kaynakları
uk: Джерела даних
vi: Nguồn dữ liệu
zh_hans: 数据来源
zh_hant: 資料來源

# rag.workspace.retrieval.tokenBudget
source: Chunk Context Token Budget
ar: ميزانية رموز سياق الأجزاء
de: Chunk-Kontext-Token-Budget
es: Presupuesto de tokens de contexto de fragmento
fr: Budget de jetons de contexte de fragment
id: Anggaran Token Konteks Potongan
it: Budget token contesto blocchi
ja: チャンクコンテキストトークン予算
ko: 청크 컨텍스트 토큰 예산
nl: Brokcontext-tokenbudget
pl: Budżet tokenów kontekstu fragmentu
pt_br: Orçamento de tokens de contexto do fragmento
ru: Бюджет токенов контекста фрагментов
tr: Parça Bağlamı Token Bütçesi
uk: Бюджет токенів контексту фрагмента
vi: Ngân sách token ngữ cảnh khối
zh_hans: 分片上下文 Token 预算
zh_hant: 分塊上下文 Token 預算

# rag.workspace.retrieval.tokenBudget.hint
source: Maximum tokens reserved for local chunks.
ar: الحد الأقصى للرموز المحجوزة للأجزاء المحلية.
de: Maximale Tokens, die für lokale Chunks reserviert sind.
es: Máximo de tokens reservados para fragmentos locales.
fr: Nombre maximum de jetons réservés aux fragments locaux.
id: Token maksimum yang dicadangkan untuk potongan lokal.
it: Token massimi riservati per i blocchi locali.
ja: ローカルチャンクに割り当てる最大トークン数。
ko: 로컬 청크에 예약된 최대 토큰 수입니다.
nl: Maximum aantal tokens gereserveerd voor lokale brokken.
pl: Maksymalna liczba tokenów zarezerwowanych dla lokalnych fragmentów.
pt_br: Máximo de tokens reservados para fragmentos locais.
ru: Максимальное количество токенов, зарезервированных для локальных фрагментов.
tr: Yerel parçalar için ayrılan maksimum token.
uk: Максимальна кількість токенів, зарезервованих для локальних фрагментів.
vi: Số token tối đa dành riêng cho các khối cục bộ.
zh_hans: 为本地分片预留的最大 Token。
zh_hant: 為本地分塊保留的最大 Token 數。

# rag.workspace.scrollToBottom
source: Scroll to bottom
ar: التمرير إلى الأسفل
de: Nach unten scrollen
es: Desplazar al final
fr: Défiler vers le bas
id: Gulir ke bawah
it: Scorri in fondo
ja: 一番下にスクロール
ko: 맨 아래로 스크롤
nl: Naar onder scrollen
pl: Przewiń na dół
pt_br: Rolar para o final
ru: Прокрутить вниз
tr: En alta kaydır
uk: Прокрутити вниз
vi: Cuộn xuống cuối
zh_hans: 滚动到底部
zh_hant: 捲動至底部
